module("HttpCode",package.seeall)

HTTP_CODE_NO_PING = -1  --网络不通
--标准HTTP状态码
HTTP_CODE_NO_RESOURSE = 404 ---请求失败，找不到服务器资源
HTTP_CODE_SERVER_ERROR = 500    --服务器内部错误
HTTP_CODE_NETWORK_OVERTIME = 504    --网关超时
--600-999为自定义的错误(不能超过999)
--
HTTP_CODE_NO_HP = 701   --生命值不足
HTTP_CODE_NO_ITEM = 702 --道具不足

------------------------------------callback---------------------
Callback = {}
function RegisterCallback(httpCode,callback)
    Callback[httpCode] = callback
end

----------------------------------------------------------------
--
--
Msg = {
--[-1]  = "无法连接网络，请检查设备的网络状况。",
--标准HTTP状态码
[404] = "找不到远程服务器资源。",
--[500] = "连接网络超时，请检查设备的网络状况。",
--[504] = "连接网络超时，请检查设备的网络状况。",
--600-999为自定义的错误(不能超过999)
[600] = "登录异常，请重新尝试登录。",
[601] = "账号在别处登录，请重新尝试登录。", 
[602] = "登录异常，请重新尝试登录。",
[603] = "错误请求，没有找到该商品。",
[604] = "元宝不足,去商店看看吧",
[605] = "铜钱不足,去商店看看吧",
[606] = "该玩家不存在。",
[607] = "错误请求，背包没有该道具。",
[608] = "错误请求，商城没有该道具。",
[609] = "错误请求，没有分数记录。",
[610] = "错误请求,5点生命值以下才可以请求恢复生命值。",
[611] = "时间验证不准确,不能恢复生命值。",
[612] = "错误请求，找不到该用户或该关卡。",
[613] = "你已到达了最后一关！！！",
[614] = "生命值不足，请前往商城购买。",
[615] = "该关卡还没有解锁，请先完成前面的关卡再来～",
[616] = "道具不足,请前往商城购买。",
[617] = "错误请求，找不到该场景。",
[618] = "上个场景的关卡还未完成，不能解锁该场景。",
[619] = "星星数不足,不能解锁该场景。",
[620] = "需要解锁该场景,才能开启该关卡。",
[621] = "已经赠送过了,需要时间冷却，请耐心等待。",
[622] = "没有该好友。",
[623] = "对方好友数已达到上限。",
[624] = "该道具数量已达到上限,不能再购买。",
[625] = "生命值已达到上限,不能再购买。",
[626] = "铜钱数量已达到上限,不能购买。",
[627] = "上一关卡没有过关,该关卡不能开始。",
[628] = "传入的关卡等级不合理。",
[629] = "传入的关卡分数不合理。",
[630] = "对方已经是你好友。",
[631] = "已经接受该好友请求。",
[632] = "时间还为冷却，不能给好友送心",  
[633] = "邀请码无效",  
[635] = "已被邀请",  
[636] = "领取异常", 
[637] = "已经不是好友",
[638] = "对方好友数量超过上限,不能添加好友",
[639] = "好友数量超过上限,不能添加好友",
}

